rails-part-one/app/controllers/members_controller.rb

SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "members" ("first_name", "last_name", "mirror_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "hello"], ["last_name", "vanessa"], ["mirror_id", 6], ["created_at", "2017-09-24 02:13:21.326068"], ["updated_at", "2017-09-24 02:13:21.326068"]]
---
	def create
	    @mirror = Mirror.find(params[:mirror_id])
	    @member = @mirror.members.create(member_params)

SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "members".* FROM "members" WHERE "members"."mirror_id" = ? AND "members"."id" = ? LIMIT ?  [["mirror_id", 6], ["id", 1], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]
---
	def destroy
	    @mirror = Mirror.find(params[:mirror_id])
	    @member = @mirror.members.find(params[:id])
	    @member.destroy