rails-part-one/app/controllers/mirrors_controller.rb

  def index
  	@mirrors = Mirror.all
---
SELECT "mirrors".* FROM "mirrors"

  def show
  	@mirror = Mirror.find(params[:id])
---
SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
  	@mirror = Mirror.find(params[:id])
---
SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	@mirror = Mirror.new(article_params)

  	@mirror.save
---
INSERT INTO "mirrors" ("codename", "created_at", "updated_at") VALUES (?, ?, ?)  [["codename", "hello"], ["created_at", "2017-09-24 00:23:22.233668"], ["updated_at", "2017-09-24 00:23:22.233668"]]

  def destroy
    @mirror = Mirror.find(params[:id])
    @mirror.destroy
---
SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "mirrors" WHERE "mirrors"."id" = ?  [["id", 1]]

  def activities
    @mirror = Mirror.find(params[:id])
    output = {}
    @mirror.members.each do |member|
---
SELECT  "mirrors".* FROM "mirrors" WHERE "mirrors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."mirror_id" = ?  [["mirror_id", 6]]